InformationRegisters/бит_ЗначенияСвойствОбъектовУчетаПериодические.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ЗначенияСвойствОбъектовУчетаПериодические</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_СвойстваОбъектовУчета</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидСвойства</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_СвойстваОбъектовУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/лб_НастройкиОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>лб_НастройкиОбмена</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УслугаЖКХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантУслуги</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоПени</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Основная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидОплатыКУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.лб_ВидыОплат</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НаправлениеОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.лб_НаправленияОбмена</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗагрузкаВыгрузка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.лб_ИмпортЭкспорт</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерПоля</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторПоставщика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтрокаКода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПозицияКода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/лб_Настройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>лб_Настройки</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УслугаГазоснабжения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УслугаДомофон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УслугаСодержанииеИРемонт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УслугиСодержаниеРемонтСОИ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ШаблоныИзвещений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РаздельнаяОплатаСодержанияРемонтаСОИ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МинимальныйРазмерПросроченнойЗадолженности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УслугаСОИ_ХВ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УслугаСОИ_ГВ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УслугаСОИ_ВО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УслугаСОИ_ЭЛ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УслугиАнтенна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ШаблоныИзвещений</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_СведенияОКвартире.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_СведенияОКвартире</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбщаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖилаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МОП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтапливаемаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СовокупнаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипПлиты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыПлиты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипЗапирающегоУстройства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыЗапирающихУстройств</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖилоеПомещениеСпециализированногоЖилищногоФонда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлощадьОДНСОИЭлектроснаб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлощадьОДНСОИВодоснаб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВысотаПотолков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ПредставлениеКвартиры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ИгнорироватьСальдоСвоихУслуг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_НеВыводитьСтрокуДомофон</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ПлощадьКапремонта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Квартира</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Квартиры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/лб_ДоступныеВидыОплат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>лб_ДоступныеВидыОплат</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.лб_ВидыОплат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/лб_ОтветственныеЗаЛицевыеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>лб_ОтветственныеЗаЛицевыеСчета</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/лб_ИмпортЭкспорт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>лб_ИмпортЭкспорт</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выгрузка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Загрузка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгрузкаИЗагрузка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>b</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/бит_ГрафыОтчетаПоГЦЖС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ГрафыОтчетаПоГЦЖС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Техобслуживание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатаЗаНайм</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВывозБытовыхОтходов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отопление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Водопровод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Электроэнергия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Газ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГорячееВодоснобжение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ХолодноеВодоснабжение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОчисткаСтоков</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ХВСДляГВС</Name>
					<Comment>Холодная вода для подогрева и обеспечения горячего водоснабжения</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КапитальныйРемонт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/бит_ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ТипыКонтактнойИнформации</Name>
			<Comment>БИТ</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/лб_Сервер/Ext/Module.bsl
Функция КонтрольныйРазряд(знач КодЛС, знач ЧислоЦифр=0) Экспорт 
	//Правила расчета контрольного разряда
	//первая цифра умножаем на 1, вторая на 3, третья на 7, четвертая снова на 1 и т.д.
	//стандартная длина без контрольного разряда - 10 цифр, поэтому при расчете для
	//11-тизначного числа последнюю цифру не учитываем
	
	
	
	Если ТипЗнч(КодЛС)=Тип("Число") тогда
		КодЛС = Формат(КодЛС,"ЧЦ=10; ЧВН=; ЧГ=");
	КонецЕсли;	
	
	Если СтрДлина(КодЛС) = 11 тогда
		КодЛС = лев(КодЛС,10);		
		ЧислоЦифр = 10;	
	КонецЕсли;	
	
	Если ЧислоЦифр =0 тогда
		ЧислоЦифр = СтрДлина(КодЛС)
	КонецЕсли;	
	
	Если ЧислоЦифр>СтрДлина(КодЛС) тогда
		КодЛС = прав("0000000000000000000000000000"+КодЛС,ЧислоЦифр);
	КонецЕсли;	
	
	Сумма = 0;
	Для Счетчик = 1 По ЧислоЦифр Цикл
		Цифра = сред(КодЛС,Счетчик,1);		
		Если Счетчик % 3 =1 тогда
			Множитель = 7     //разряды 1,4,7,10 ...
		ИначеЕсли Счетчик %	3 = 2 тогда
			Множитель =1     //разряды 2,5,8 ...
		иначе
			Множитель = 3     //разряды 3,6,9 ....
		КонецЕсли;	
		
		Сумма = Сумма + Цифра * Множитель;
	
	КонецЦикла;
	
	Результат = Сумма * 3;
	КонтрСумма = Результат%10;
	
	Возврат Строка(КонтрСумма);
	
КонецФункции

Функция СвойствоЗдания(Период, Здание, имяСвойства) Экспорт 	
	Свойство = ПланыВидовХарактеристик.бит_СвойстваОбъектовУчета[имяСвойства];
	Запрос = новый запрос;
	Запрос.УстановитьПараметр("Период",Период);
	Запрос.УстановитьПараметр("Свойство",Свойство);
	Запрос.УстановитьПараметр("Здание",Здание);
	Запрос.Текст =   "ВЫБРАТЬ
	                |	бит_ЗначенияСвойствОбъектовУчетаПериодическиеСрезПоследних.Значение КАК Значение
	                |ИЗ
	                |	РегистрСведений.бит_ЗначенияСвойствОбъектовУчетаПериодические.СрезПоследних(
	                |			&Период,
	                |			ВидСвойства = &Свойство
	                |				И ОбъектУчета = &Здание) КАК бит_ЗначенияСвойствОбъектовУчетаПериодическиеСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() тогда
		возврат выборка.Значение
	иначе	
		возврат неопределено
	КонецЕсли;	
		
КонецФункции	

Функция ПолучитьТаблицуКодовПочты(ШаблонИзвещения=Неопределено) Экспорт 
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	ТаблицаЗначений.Колонки.Добавить("УслугаЖКХ", Новый ОписаниеТипов("СправочникСсылка.бит_УслугиЖКХ"));
	ТаблицаЗначений.Колонки.Добавить("ЭтоПени", Новый ОписаниеТипов("Булево"));
	ТаблицаЗначений.Колонки.Добавить("СтрокаКода", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(1, 0)));
	ТаблицаЗначений.Колонки.Добавить("ПозицияКода", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(2, 0)));
	ТаблицаЗначений.Колонки.Добавить("ИдентификаторПоставщика", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(4, 0)));
	
	ЗагрузкаВыгрузка = Новый СписокЗначений;
	ЗагрузкаВыгрузка.Добавить(Перечисления.лб_ИмпортЭкспорт.ВыгрузкаИЗагрузка);
	ЗагрузкаВыгрузка.Добавить(Перечисления.лб_ИмпортЭкспорт.Выгрузка);
	
	СписокУС = Новый СписокЗначений;
	ЕстьОтборУслуг = Ложь;
	
	Если ТипЗнч(ШаблонИзвещения) = Тип("СправочникСсылка.бит_ШаблоныИзвещений") И НЕ ШаблонИзвещения = Справочники.бит_ШаблоныИзвещений.ПоВсемУслугам Тогда
		СписокУС.ЗагрузитьЗначения(ШаблонИзвещения.Услуги.ВыгрузитьКолонку("Услуга"));
		ЕстьОтборУслуг = СписокУС.Количество() > 0;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокУС", СписокУС);
	Запрос.УстановитьПараметр("ЕстьОтборУслуг", ЕстьОтборУслуг);
	Запрос.УстановитьПараметр("НаправлениеОбмена", Справочники.лб_НаправленияОбмена.Почта);
	Запрос.УстановитьПараметр("ЗагрузкаВыгрузка", ЗагрузкаВыгрузка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	лб_НастройкиОбмена.Основная КАК Основная,
	               |	лб_НастройкиОбмена.СтрокаКода КАК СтрокаКода,
	               |	лб_НастройкиОбмена.ПозицияКода КАК ПозицияКода,
	               |	лб_НастройкиОбмена.ИдентификаторПоставщика КАК ИдентификаторПоставщика,
	               |	лб_НастройкиОбмена.УслугаЖКХ КАК УслугаЖКХ,
	               |	лб_НастройкиОбмена.ЭтоПени КАК ЭтоПени
	               |ИЗ
	               |	РегистрСведений.лб_НастройкиОбмена КАК лб_НастройкиОбмена
	               |ГДЕ
	               |	лб_НастройкиОбмена.ЗагрузкаВыгрузка В(&ЗагрузкаВыгрузка)
	               |	И лб_НастройкиОбмена.НаправлениеОбмена = &НаправлениеОбмена
	               |	И ВЫБОР
	               |			КОГДА &ЕстьОтборУслуг
	               |				ТОГДА лб_НастройкиОбмена.УслугаЖКХ В (&СписокУС)
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |	И НЕ лб_НастройкиОбмена.ЭтоПени
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	УслугаЖКХ,
	               |	Основная УБЫВ
	               |ИТОГИ ПО
	               |	УслугаЖКХ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	лб_НастройкиОбмена.СтрокаКода КАК СтрокаКода,
	               |	лб_НастройкиОбмена.ПозицияКода КАК ПозицияКода,
	               |	лб_НастройкиОбмена.ИдентификаторПоставщика КАК ИдентификаторПоставщика,
	               |	лб_НастройкиОбмена.ЭтоПени КАК ЭтоПени,
	               |	лб_НастройкиОбмена.УслугаЖКХ КАК УслугаЖКХ,
	               |	лб_НастройкиОбмена.Основная КАК Основная
	               |ИЗ
	               |	РегистрСведений.лб_НастройкиОбмена КАК лб_НастройкиОбмена
	               |ГДЕ
	               |	лб_НастройкиОбмена.ЗагрузкаВыгрузка В(&ЗагрузкаВыгрузка)
	               |	И лб_НастройкиОбмена.НаправлениеОбмена = &НаправлениеОбмена
	               |	И ВЫБОР
	               |			КОГДА &ЕстьОтборУслуг
	               |				ТОГДА лб_НастройкиОбмена.УслугаЖКХ В (&СписокУС)
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |	И лб_НастройкиОбмена.ЭтоПени
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	УслугаЖКХ,
	               |	Основная УБЫВ
	               |ИТОГИ ПО
	               |	УслугаЖКХ";
	
	Выборка = Запрос.ВыполнитьПакет();
	ВыборкаБезПени = Выборка[0].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаБезПени.Следующий() Цикл
		 Строка = ВыборкаБезПени.Выбрать();
		 Строка.Следующий();
		 ЗаполнитьЗначенияСвойств(ТаблицаЗначений.Добавить(), Строка);		 
    КонецЦикла;    
	
	ВыборкаПени = Выборка[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПени.Следующий() Цикл
		 Строка = ВыборкаПени.Выбрать();
		 Строка.Следующий();
		 ЗаполнитьЗначенияСвойств(ТаблицаЗначений.Добавить(), Строка);	
    КонецЦикла; 

	Возврат ТаблицаЗначений;

КонецФункции

Функция ПолучитьСтрокуКодаПочты(ТаблицаКодовПочты, МассивУслуг, МассивУслугПени) Экспорт 
	
	СтруктураКодов = ПолучитьСтруктуруКодовПочты();
	
	Для Каждого Услуга Из МассивУслуг Цикл
		
		Отбор = Новый Структура();
		Отбор.Вставить("УслугаЖКХ", Услуга);
		Строки = ТаблицаКодовПочты.НайтиСтроки(Отбор);
		Если Строки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;	
		
		Строка = Строки[0];
		
		Если Строка.СтрокаКода < 1 И Строка.СтрокаКода > 2 ИЛИ Строка.ПозицияКода = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НужноеЗначенияКлюча = "";
		
		Если Услуга.лб_ГруппаУслугДляПечати = Справочники.лб_ГруппыУслугДляПечати.Левобережье Тогда
			НужноеЗначенияКлюча = "Код";	
		ИначеЕсли Услуга.лб_ГруппаУслугДляПечати = Справочники.лб_ГруппыУслугДляПечати.КапРемонтЛевобережье Тогда
			НужноеЗначенияКлюча = "КодКР";
		ИначеЕсли Услуга.лб_ГруппаУслугДляПечати = Справочники.лб_ГруппыУслугДляПечати.КапРемонтРФКР Тогда
			НужноеЗначенияКлюча = "КодРФКР";
		ИначеЕсли Услуга.лб_ГруппаУслугДляПечати = Справочники.лб_ГруппыУслугДляПечати.Тепло Тогда
			НужноеЗначенияКлюча = "КодТепло";
		Иначе 
			Продолжить;	
		КонецЕсли;
		
		Если СтрДлина(НужноеЗначенияКлюча) = 0 Тогда
			Продолжить;	
		КонецЕсли;
		
		СтароеЗначение = СтруктураКодов[НужноеЗначенияКлюча + Строка(Строка.СтрокаКода)];
		
		СтруктураКодов.Вставить(НужноеЗначенияКлюча + Строка(Строка.СтрокаКода), Лев(СтароеЗначение, Строка.ПозицияКода-1) + 
																				   Строка(Строка.ИдентификаторПоставщика) + 
																				   Прав(СтароеЗначение, 10-Строка.ПозицияКода));
		
	КонецЦикла;
																			   
	Для Каждого Услуга Из МассивУслугПени Цикл
		
		Отбор = Новый Структура();
		Отбор.Вставить("УслугаЖКХ", Услуга);
		Строки = ТаблицаКодовПочты.НайтиСтроки(Отбор);
		Если Строки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;	
		
		Строка = Строки[0];
		
		Если Строка.СтрокаКода < 1 И Строка.СтрокаКода > 2 ИЛИ Строка.ПозицияКода = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НужноеЗначенияКлюча = "";
		
		Если Услуга.лб_ГруппаУслугДляПечати = Справочники.лб_ГруппыУслугДляПечати.Левобережье Тогда
			НужноеЗначенияКлюча = "Код";	
		ИначеЕсли Услуга.лб_ГруппаУслугДляПечати = Справочники.лб_ГруппыУслугДляПечати.КапРемонтЛевобережье Тогда
			НужноеЗначенияКлюча = "КодКР";
		ИначеЕсли Услуга.лб_ГруппаУслугДляПечати = Справочники.лб_ГруппыУслугДляПечати.КапРемонтРФКР Тогда
			НужноеЗначенияКлюча = "КодРФКР";
		ИначеЕсли Услуга.лб_ГруппаУслугДляПечати = Справочники.лб_ГруппыУслугДляПечати.Тепло Тогда
			НужноеЗначенияКлюча = "КодТепло";
		Иначе 
			Продолжить;	
		КонецЕсли;
		
		Если СтрДлина(НужноеЗначенияКлюча) = 0 Тогда
			Продолжить;	
		КонецЕсли;
		
		СтароеЗначение = СтруктураКодов[НужноеЗначенияКлюча + Строка(Строка.СтрокаКода)];
		
		СтруктураКодов.Вставить(НужноеЗначенияКлюча + Строка(Строка.СтрокаКода), Лев(СтароеЗначение, Строка.ПозицияКода-1) + 
																				   Строка(Строка.ИдентификаторПоставщика) + 
																				   Прав(СтароеЗначение, 10-Строка.ПозицияКода));
		
	КонецЦикла;
	
	Для Каждого КлючИЗначение из СтруктураКодов Цикл
		СтруктураКодов.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение + КонтрольныйРазряд(КлючИЗначение.Значение));
	КонецЦикла;	
	
	Возврат СтруктураКодов;
	
КонецФункции

Функция ПолучитьСтруктуруКодовПочты() Экспорт

	СтруктураКодов = Новый Структура;
	СтруктураКодов.Вставить("Код1", "0000000000");
	СтруктураКодов.Вставить("Код2", "0000000000");
	СтруктураКодов.Вставить("КодКР1", "0000000000");
	СтруктураКодов.Вставить("КодКР2", "0000000000");
	СтруктураКодов.Вставить("КодРФКР1", "0000000000");
	СтруктураКодов.Вставить("КодРФКР2", "0000000000");
	СтруктураКодов.Вставить("КодТепло1", "0000000000");
	СтруктураКодов.Вставить("КодТепло2", "0000000000");

	Возврат СтруктураКодов
	
КонецФункции // ПолучитьСтруктуруКодовПочты()

Функция лб_ПолучитьНастройкуРС(ИмяНастройки,Дата = неопределено) Экспорт
	перем Значение;
	
	Отбор = новый структура;
	СтруктураРС = РегистрыСведений.лб_Настройки.ПолучитьПоследнее(Дата,Отбор);	
	Если СтруктураРС.Свойство(ИмяНастройки,Значение) тогда
		возврат Значение
	иначе 		
		возврат неопределено
	КонецЕсли;	
	
КонецФункции	

функция лб_ПолучитьСписокУслугИзШаблонаИзвещения(Шаблон) экспорт
	массив = новый массив;
	Настройка = Шаблон;
	Если Не ЗначениеЗаполнено(Настройка) тогда
		//пустой массив
	ИначеЕсли 	ТипЗнч(Настройка) = Тип("СправочникСсылка.бит_УслугиЖКХ") тогда
		массив.Добавить(Настройка);
	ИначеЕсли Настройка = Справочники.бит_ШаблоныИзвещений.ПоВсемЗаМесяц или
		      Настройка = Справочники.бит_ШаблоныИзвещений.ПоВсемУслугам или
			  Настройка = Справочники.бит_ШаблоныИзвещений.ПоВсемУслугамДолговой  тогда
		Выборка = Справочники.бит_УслугиЖКХ.Выбрать();
		Пока Выборка.Следующий() цикл
			массив.Добавить(Выборка.Ссылка);
		КонецЦикла;
	ИначеЕсли Настройка = Справочники.бит_ШаблоныИзвещений.КапитальныйРемонт или 
			      Настройка = Справочники.бит_ШаблоныИзвещений.БезКапитальногоРемонта тогда
		ТекстЗапроса = "ВЫБРАТЬ
		               |	бит_УслугиЖКХ.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.бит_УслугиЖКХ КАК бит_УслугиЖКХ
		               |ГДЕ					   
		               |	бит_УслугиЖКХ.ГрафаОтчетаГЦЖС <> &ГрафаОтчетаГЦЖС";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"<>",
						?(Настройка = Справочники.бит_ШаблоныИзвещений.КапитальныйРемонт,"=","<>"));
		
 	    Запрос = новый запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("ГрафаОтчетаГЦЖС",Перечисления.бит_ГрафыОтчетаПоГЦЖС.КапитальныйРемонт);		
		массив = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");					   
	иначеЕсли  ТипЗнч(Настройка) = Тип("СправочникСсылка.бит_ШаблоныИзвещений") тогда	
		Запрос = новый запрос;
		Запрос.УстановитьПараметр("Ссылка",Настройка);
		Запрос.Текст = "ВЫБРАТЬ
		               |	бит_ШаблоныИзвещенийУслуги.Услуга КАК Услуга
		               |ИЗ
		               |	Справочник.бит_ШаблоныИзвещений.Услуги КАК бит_ШаблоныИзвещенийУслуги
		               |ГДЕ
		               |	бит_ШаблоныИзвещенийУслуги.Ссылка = &Ссылка";
		
		массив = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Услуга");					   		
	иначе 
		//пустой массив		
	КонецЕсли;	
	возврат массив

КонецФункции	

Функция лб_ПолучитьНастройкуМассивУслуг(ИмяНастройки,Дата) Экспорт
	Настройка = лб_ПолучитьНастройкуРС(ИмяНастройки,Дата);
	возврат лб_ПолучитьСписокУслугИзШаблонаИзвещения(Настройка)
КонецФункции	

Функция лб_АдресЛС(СсылкаЛицевойСчет, Дата = неопределено) Экспорт
		
	Если Дата = Неопределено Тогда
		Дата = ТекущаяДата()
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", КонецМесяца(Дата));
	Запрос.УстановитьПараметр("Квартира", СсылкаЛицевойСчет.Квартира);
	Запрос.Текст = "ВЫБРАТЬ
				|	бит_СведенияОКвартиреСрезПоследних.лб_ПредставлениеКвартиры КАК лб_ПредставлениеКвартиры
				|ИЗ
				|	РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&Дата, Квартира = &Квартира) КАК бит_СведенияОКвартиреСрезПоследних";
	Результат = Запрос.Выполнить().Выгрузить();
	
	лб_ПредставлениеКвартиры = "";
	Если Результат.Количество() > 0 Тогда
		лб_ПредставлениеКвартиры = Результат[0].лб_ПредставлениеКвартиры;
	КонецЕсли;
		
	С = СсылкаЛицевойСчет.Здание.ссылка;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	лб_Тест_Дома.ADR КАК ADR
		|ИЗ
		|	РегистрСведений.лб_Тест_Дома КАК лб_Тест_Дома
		|ГДЕ
		|	лб_Тест_Дома.Здание = &С";
	
	Запрос.УстановитьПараметр("С", С);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		Адрес1 = ВыборкаДетальныеЗаписи.ADR; 
	КонецЦикла;
			
	//Адрес = Строка(СсылкаЛицевойСчет.УлицаЛицевогоСчета) + ", " + 
	//		" д. " + Строка(СсылкаЛицевойСчет.Здание.НомерДома)
	//			+?(ЗначениеЗаполнено(СсылкаЛицевойСчет.Здание.ПрефиксДома), СсылкаЛицевойСчет.Здание.ПрефиксДома, "")
	//			+?(ЗначениеЗаполнено(СсылкаЛицевойСчет.Здание.Корпус),", к. "+ СсылкаЛицевойСчет.Здание.Корпус, "");
	
	
				
	НомерКвартиры = ?(ЗначениеЗаполнено(лб_ПредставлениеКвартиры), " кв. " + лб_ПредставлениеКвартиры, " кв. " + Строка(СсылкаЛицевойСчет.Квартира));
	
	Если СсылкаЛицевойСчет.Здание.КонтактнаяИнформация.Количество() > 0 Тогда 
		
		АдресПроживания = ?(ЗначениеЗаполнено(СсылкаЛицевойСчет.Здание.ПочтовыйАдрес),Строка(СсылкаЛицевойСчет.Здание.ПочтовыйАдрес), Адрес1); 
		НомерКвартиры = ?(ЗначениеЗаполнено(лб_ПредставлениеКвартиры), " кв. " + Строка(лб_ПредставлениеКвартиры), 
							?(ЗначениеЗаполнено(СсылкаЛицевойСчет.Квартира), " кв. " + Строка(СсылкаЛицевойСчет.Квартира), НомерКвартиры));	
	Иначе	
		АдресПроживания = Адрес1;	
	КонецЕсли;
	
	НомерПозиции = СтрНайти(НомерКвартиры, "=");
	
	Если НомерПозиции <> 0 Тогда
		НомерКвартиры = Лев(НомерКвартиры, НомерПозиции - 1)
	КонецЕсли;

	Адрес = сокрлп(Адрес1) + НомерКвартиры;

	Возврат Адрес
		
КонецФункции


Функция лб_Адрес(Квартира,Дата=неопределено,Сокращенный=истина) экспорт
	Если ложь тогда Квартира = Справочники.бит_Квартиры.Выбрать().Ссылка КонецЕсли;
	Дом = Квартира.Владелец;
	
	Если Сокращенный = истина тогда
		АдресДома = ""+Дом.Улица + ", д."+Дом.НомерДома+Дом.ПрефиксДома;
	Иначе
		ВидКИ = Справочники.бит_ВидыКонтактнойИнформации.ПочтовыйАдресЗдания;
		ТипКИ = Перечисления.бит_ТипыКонтактнойИнформации.Адрес;
		ЗАпрос = новый запрос;
		Запрос.УстановитьПараметр("Вид",ВидКИ);
		Запрос.УстановитьПараметр("Тип",ТипКИ);
		ЗАпрос.УстановитьПараметр("Объект",Дом);
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	бит_КонтактнаяИнформация.Представление
			|ИЗ
			|	РегистрСведений.бит_КонтактнаяИнформация КАК бит_КонтактнаяИнформация
			|ГДЕ
			|	бит_КонтактнаяИнформация.Объект = &Объект
			|	И бит_КонтактнаяИнформация.Тип = &Тип
			|	И бит_КонтактнаяИнформация.Вид = &Вид";
		Выборка = ЗАпрос.Выполнить().Выбрать();
		Если Выборка.Следующий() тогда
			АдресДома = Выборка.Представление;
		иначеЕсли Не ПустаяСтрока(Дом.ПочтовыйАдрес) тогда
			АдресДома = Дом.ПочтовыйАдрес; 
		иначе	
			АдресДома = "*** Почтовый адрес дома "+ Дом.Код + " не заполнен ***";
		КонецЕсли;
	КонецЕсли;
	
	Запрос = новый запрос;
	Запрос.УстановитьПараметр("Квартира",Квартира);
	ЗАпрос.УстановитьПараметр("Дата",Дата);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_СведенияОКвартиреСрезПоследних.лб_ПредставлениеКвартиры КАК ПредставлениеКвартиры
		|ИЗ
		|	РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&Дата, Квартира = &Квартира) КАК бит_СведенияОКвартиреСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() и НЕ ПустаяСтрока(Выборка.ПредставлениеКвартиры) тогда
		ПервыйСимволПредставления = лев(Выборка.ПредставлениеКвартиры,1);
		пр1 = ?(СтрНайти("0123456789",ПервыйСимволПредставления)>0,"кв.",""); 
		Адрес = АдресДома + ", "+пр1+ Выборка.ПредставлениеКвартиры;
	иначе
		Адрес = АдресДома + ", кв."+Квартира.НомерКвартиры + Квартира.ПрефиксКвартиры
	КонецЕсли;	
		
	возврат Адрес	
КонецФункции


#Область ГруппыУслугИРежимов
// Функция - Режим потрбления газ по счетчикам
// 
// Возвращаемое значение:
//   СправочникСсылка.бит_РежимыПотребленияУслуг - режим потребления газ по счетчикам
//
Функция РежимПотрбленияГазПоСчетчикам(Дата = неопределено) экспорт
	Возврат Справочники.бит_РежимыПотребленияУслуг.ПустаяСсылка()
КонецФункции	

// Функция - Режимы потребления газ по нормативу
// 
// Возвращаемое значение:
//  массив - массив ,тип элементов  СправочникСсылка.бит_РежимыПотребленияУслуг,
//           массив, содержащий режимы потребления для расчетов по нормативу
//
Функция РежимыПотребленияГазПоНормативу(Дата = неопределено) экспорт
	ГазПоСчетчику = РежимПотрбленияГазПоСчетчикам(Дата);
	УслугаГаз = лб_ПолучитьНастройкуРС("УслугаГазоснабжения",Дата);
	Если ложь тогда УслугаГаз = Справочники.бит_УслугиЖКХ.ПустаяСсылка() КонецЕсли;
	Результат = новый массив;
	Если ЗначениеЗаполнено(УслугаГаз) тогда
		Для каждого СтрокаТЧ из УслугаГаз.РежимыПотребленияУслуг цикл
			Если СтрокаТЧ.РежимПотребленияУслуг <> Справочники.бит_РежимыПотребленияУслуг.НеНачислять и 
					СтрокаТЧ.РежимПотребленияУслуг <> Справочники.бит_РежимыПотребленияУслуг.Нет и 
					СтрокаТЧ.РежимПотребленияУслуг <> ГазПоСчетчику тогда
				Результат.Добавить(СтрокаТЧ.РежимПотребленияУслуг);	
			КонецЕсли;		
		КонецЦикла;			
	КонецЕсли;
	
	возврат результат;
КонецФункции	

// Функция - Услуги содержание ремонт ОДН
// 
// Возвращаемое значение:
//   массив - массив ,тип элементов  СправочникСсылка.бит_УслугиЖКХ,
//           содержащит услуги Содержание и ремонт, и услуги ОДН 
//
//
Функция УслугиСодержаниеРемонтОДН(Дата = неопределено) экспорт        
	МассУслуг = Новый Массив();
	МассУслуг.Добавить(Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000001"));
	МассУслуг.Добавить(Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000004"));
	МассУслуг.Добавить(Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000003"));
	МассУслуг.Добавить(Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000005"));
	МассУслуг.Добавить(Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000002"));
	возврат МассУслуг;//лб_ПолучитьНастройкуМассивУслуг("УслугиСодержаниеРемонтСОИ",Дата);	
КонецФункции	

Функция УслугаСодержаниеРемонт(Дата = неопределено) экспорт
	возврат Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000001");//лб_ПолучитьНастройкуРС("УслугаСодержанииеИРемонт",Дата);
КонецФункции	

Функция УслугиОДН(Дата = неопределено) экспорт
	Результат = УслугиСодержаниеРемонтОДН(Дата);
	Если ложь тогда Результат = новый массив КонецЕсли;
	УслугаСРЖ = УслугаСодержаниеРемонт(Дата);
	ЧислоУслуг = Результат.Количество();
	Для СчетВниз = 1 по ЧислоУслуг цикл
		Если Результат[ЧислоУслуг-СчетВниз]=УслугаСРЖ тогда
			Результат.Удалить(ЧислоУслуг-СчетВниз);
		КонецЕсли;	
	КонецЦикла;	
	возврат Результат;
КонецФункции	

Функция УслугаОДН_ХВ(Дата = неопределено) экспорт
	
	возврат лб_ПолучитьНастройкуРС("УслугаСОИ_ХВ",Дата);
КонецФункции	

Функция УслугаОДН_ГВ(Дата = неопределено) экспорт
	возврат лб_ПолучитьНастройкуРС("УслугаСОИ_ГВ",Дата);
КонецФункции	

Функция УслугаОДН_ВО(Дата = неопределено) экспорт
	возврат лб_ПолучитьНастройкуРС("УслугаСОИ_ВО",Дата);
КонецФункции

Функция УслугаОДН_ЭЭ(Дата = неопределено) экспорт
	возврат лб_ПолучитьНастройкуРС("УслугаСОИ_ЭЛ",Дата);
КонецФункции	

Функция Услуга_ХВ(Дата = неопределено) экспорт
	
	возврат Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000004");
КонецФункции	

Функция Услуга_ГВ(Дата = неопределено) экспорт
	возврат  Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000003");
КонецФункции	

Функция Услуга_ВО(Дата = неопределено) экспорт
	возврат  Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000005");
КонецФункции

Функция Услуга_ЭЭ(Дата = неопределено) экспорт
	возврат Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000002");
КонецФункции	


Функция УслугаГазоснабжения(Дата = неопределено) экспорт
 	возврат лб_ПолучитьНастройкуРС("УслугаГазоснабжения",Дата);
КонецФункции	

Функция УслугаДомофон(Дата = неопределено) экспорт
	возврат лб_ПолучитьНастройкуРС("УслугаДомофон",Дата);
КонецФункции	

Функция УслугиАнтенна(Дата = неопределено) экспорт
	возврат  лб_ПолучитьНастройкуМассивУслуг("УслугиАнтенна",Дата)
КонецФункции	

// Функция - Услуги дог ХВССтоки 
// 
// Возвращаемое значение:
//  массив - массив ссылок на услуги ЖКХ 
//
Функция УслугиДолгВодоотведениеХолВода(Дата = неопределено) экспорт
	Возврат Новый Массив
КонецФункции	

Функция МинимальныйРазмерПросроченнойЗадолженности(Дата=неопределено) экспорт
	возврат лб_ПолучитьНастройкуРС("УслугаДомофон",Дата);
	
КонецФункции	

Функция РаздельныйУчетПоУслугамСодержанияОДН(Дата=неопределено) экспорт
	возврат Истина
КонецФункции

Функция УслугиДляСоцЗащиты(Дата = неопределено) экспорт
	Возврат Справочники.бит_ШаблоныИзвещений.ПустаяСсылка();
КонецФункции	

Функция УслугаПечатьДоставкаКвитанцийКР(Дата = неопределено) экспорт
	возврат Справочники.бит_УслугиЖКХ.ПустаяСсылка()
	//возврат лб_ПолучитьНастройкуРС("УслугаПечатьДоставкаКвитанцийКР",Дата);
КонецФункции	

Функция НастройкаПачатиКвитанции(Здание,Дата=Неопределено)  экспорт
	Запрос = новый запрос;
	Запрос.УстановитьПараметр("ОбъектУчета",Здание);
	Запрос.УстановитьПараметр("ВидСвойства",ПланыВидовХарактеристик.бит_СвойстваОбъектовУчета.лб_НастройиПечатиКвитанции);
	Запрос.УстановитьПараметр("Дата",Дата);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_ЗначенияСвойствОбъектовУчетаПериодическиеСрезПоследних.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.бит_ЗначенияСвойствОбъектовУчетаПериодические.СрезПоследних(
		|			&Дата,
		|			ОбъектУчета = &ОбъектУчета
		|				И ВидСвойства = &ВидСвойства) КАК бит_ЗначенияСвойствОбъектовУчетаПериодическиеСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() тогда
		возврат Выборка.Значение;
	иначе
		возврат Справочники.лб_НастройкиПечатиКвитанций.ПустаяСсылка()
	КонецЕсли;	
КонецФункции
#КонецОбласти


// Функция - Список доступных видов оплат
//
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи - пользователь, для которого ищем доступные виды оплат.
//					Если не заполнен, то подразумевается текущий пользователь		
// 
// Возвращаемое значение:
//   массив - массив доступных пользователю видов оплат
//
Функция СписокДоступныхВидовОплат(знач Пользователь=неопределено) экспорт
	Если не ЗначениеЗаполнено(Пользователь) тогда
		Пользователь = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;	
	
	Запрос = новый запрос;
	Запрос.УстановитьПараметр("Пользователь",Пользователь);
	Запрос.УстановитьПараметр("ПустойВидПлатежа",Справочники.лб_ВидыОплат.ПустаяСсылка());
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	лб_ВидыОплат.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.лб_ВидыОплат КАК лб_ВидыОплат
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			лб_ДоступныеВидыОплат.ВидОплаты КАК ВидПлатежа
		|		ИЗ
		|			РегистрСведений.лб_ДоступныеВидыОплат КАК лб_ДоступныеВидыОплат
		|		ГДЕ
		|			лб_ДоступныеВидыОплат.Пользователь = &Пользователь) КАК Доступные
		|		ПО лб_ВидыОплат.Ссылка = Доступные.ВидПлатежа
		|			ИЛИ (Доступные.ВидПлатежа = &ПустойВидПлатежа)";
	
	Массив = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	возврат массив
	
КонецФункции	

&НаСервере
Процедура лб_ОбновитьКолонкуОтветственныхНаСервере()
	Запрос = новый запрос;
	Запрос.УстановитьПараметр("Ответственный",Справочники.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
		|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизЛицо
		|ПОМЕСТИТЬ ИмеющиесяЛС
		|ИЗ
		|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних КАК бит_ПроживающиеПоЛССрезПоследних
		|ГДЕ
		|	бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства = &Ответственный
		|	И бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ЛицевойСчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет,
		|	ЕСТЬNULL(ИмеющиесяЛС.ФизЛицо, ЗНАЧЕНИЕ(Справочник.бит_Проживающие.ПустаяСсылка)) КАК Ответственный
		|ИЗ
		|	ИмеющиесяЛС КАК ИмеющиесяЛС
		|		ПРАВОЕ СОЕДИНЕНИЕ Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
		|		ПО ИмеющиесяЛС.ЛицевойСчет = бит_ЛицевыеСчета.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛицевойСчет,
		|	Ответственный";
	
	Табл = Запрос.Выполнить().Выгрузить();
	ТекЛС = неопределено;;
	ЧислоЛС = Табл.Количество();
	
	
	////Исходный цикл
	//Для СчетВниз=1 по ЧислоЛС цикл
	//	ТекИнд = ЧислоЛС-СчетВниз;
	//	Если ТекЛС=Табл[ТекИнд].ЛицевойСчет тогда
	//		табл.Удалить(ТекИнд)
	//	иначе
	//		ТекЛС = Табл[ТекИнд].ЛицевойСчет
	//	КонецЕсли;
	//КонецЕсли;	
	
	// Цикл одной строкой
	Для СчетВниз=1 по ЧислоЛС цикл ТекИнд = ЧислоЛС-СчетВниз; Если ТекЛС=Табл[ТекИнд].ЛицевойСчет тогда	табл.Удалить(ТекИнд)иначе ТекЛС = Табл[ТекИнд].ЛицевойСчет КонецЕсли; КонецЦикла;	

	Набор = РегистрыСведений.лб_ОтветственныеЗаЛицевыеСчета.СоздатьНаборЗаписей();
	Набор.Загрузить(Табл);
	Набор.Записать(истина);
КонецПроцедуры
